//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Введите два чиcла");
// Console.Write("Первое ");
// int numb1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Второе ");
// int numb2 = Convert.ToInt32(Console.ReadLine());
// if (numb1 > numb2)
// {
//     Console.WriteLine($"{numb1} большее число");
// }
// else 
// {
//     Console.WriteLine($"{numb2} большее число");
// }


//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.WriteLine("Введите два чиcла");
// Console.Write("Первое ");
// int numb1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Второе ");
// int numb2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Третье ");
// int numb3 = Convert.ToInt32(Console.ReadLine());
// if (numb1 > numb2)
// {
//     Console.WriteLine($"{numb1} большее число");
// }
// if (numb2 > numb3)
// {
//     Console.WriteLine($"{numb2} большее число");
// }
// else 
// {
//     Console.WriteLine($"{numb3} большее число");
// }


// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).

// Console.WriteLine("Введите число ");
// int numb = Convert.ToInt32(Console.ReadLine());
// if (numb % 2 == 0)
// {
//     Console.WriteLine($"Число {numb} четное");
// }
// else 
// {
//     Console.WriteLine($"Число {numb} нечетное");
// }


// Задача 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.

// Console.WriteLine("Введите чиcло ");
// int numb = Convert.ToInt32(Console.ReadLine());
// int numb1 = 1;
// if (numb % 2 == 0)
// {
//     while (numb1 < numb)
//     {
//     Console.Write(numb + " ");
//     numb = numb - 2;
//     }
// }
// else if (numb % 2 == 1)
// {
//     numb = numb -1;
//     while (numb1 < numb)
//     {
//     Console.Write(numb + " ");
//     numb = numb - 2;
//     }
// }
// else 
// {
// Console.WriteLine("Ошибка");
// }